01  ORDER-RECORD.
    05  OR-ORDER-NUMBER        PIC 9(8).
    05  OR-CUSTOMER-ID         PIC 9(8).
    05  OR-PO-NUMBER           PIC X(15).
    05  OR-ORDER-DATE          PIC 9(8).
    05  OR-SHIP-TO             PIC X(6).
    05  OR-ISBN                PIC X(13).
    05  OR-QUANTITY            PIC 9(5).
    05  OR-UNIT-PRICE          PIC 9(5)V99.
    05  OR-DISCOUNT-PCT        PIC 99V99.
    05  OR-ORDER-SOURCE        PIC X(1).
    05  OR-RUSH-FLAG           PIC X(1).
